# Дан список чисел. Определите, сколько в нем встречается различных чисел.

start_list = [1, 34, 7,  4, 334, 4, 5,  5, 6, 6, 6,  6, 38]

start_list_set = set(start_list)

print(start_list_set)
print((len(start_list_set)))
