# Даны два массива чисел. Требуется вывести те элементы первого массива (в том порядке, в каком они идут в первом
# массиве), которых нет во втором массиве. Пользователь вводит число N - количество элементов в первом массиве, затем N
# чисел - элементы массива. Затем число M - количество элементов во втором массиве. Затем элементы второго массива
# Ввод:
# 7
# 3 1 3 4 2 4 12
# 6
# 4 15 43 1 15 1
# Вывод:
# 3 3 2 12
# (каждое число вводится с новой строки)

first_array = '3 1 3 4 2 4 12'
second_array = '4 15 43 1 15 1'

first_array = first_array.split()
second_array = second_array.split()

for i in first_array:
    if i not in second_array:
        print(i, end=" ")
